from time import time


def time_of_function(funcion_for_check):
    def wrapper():
        start_time = time()
        result = funcion_for_check()
        end_time = round(time() - start_time, 6)
        print(f"Время выполнения {end_time} секунд")
        return result
    return wrapper


@time_of_function
def task22():
    """
Задача 22. Packed Prefix
Ограничение по времени: 0.5 с.
Ограничение по памяти: 64 Mb.
Вам даны строки в запакованном виде. Определим запакованную строку (ЗС)
рекурсивно. Строка, состоящая только из строчных букв английского алфавита, является
ЗС. Если А и В - корректные ЗС, то и AB является ЗС. Если А – ЗС, а n – однозначное
натуральное число, то n[A] тоже ЗС. При этом надпись n[A] означает, что при распаковке
строка А записывается подряд n раз. Найдите наибольший общий префикс распакованных
строк и выведите его (в распакованном виде).
Иными словами, пусть сложение – это конкатенация двух строк, а умножение строки
на число – повтор строки соответствующее число раз. Пусть функция f умеет принимать ЗС
и распаковывать её. Если ЗС D имеет вид D = AB, где A и В тоже ЗС, то f(D) = f(A) +
f(B). Если D = n[A], то f(D) = f(A) × n.
Формат ввода
В первой строке записано число 𝑛 (1 ≤ n ≤ 1000) – число строк. Далее в n строках
записаны запакованные строки. Гарантируется, что эти строки корректны, то есть
удовлетворяют указанному рекурсивному определению. Длина строк после распаковки не
превосходит 105.

Формат вывода
Выведите наибольший общий префикс распакованных строк.

Примеры
Ввод
3
2[a]2[ab]
3[a]2[r2[t]]
a2[aa3[b]]
Вывод
aaa

Ввод
3
abacabaca
2[abac]a
3[aba]
Вывод
aba

Примечания
Сложение подразумевается, как конкатенация двух строк. Умножение строки на
число – повтор строки соответствующее число раз. Пусть функция f умеет принимать ЗС и
распаковывать её. Если ЗС D имеет вид D = AB, где A и B тоже ЗС, то f(D) = f(A) + f(B).
Если D = n[A], то f(D) = f(A) × n.
    """
    def minimum(a, b): return a if a <= b else b

    def custom_isdigit(char): return '0' <= char <= '9'

    def length(l):
        n = 0
        for _ in l: n += 1
        return n

    def unpack(s):
        result = []
        i = 0
        while i < len(s):
            if custom_isdigit(s[i]):
                count = int(s[i])
                i += 1

                start = i + 1
                end = s.find(']', start)
                inner_string = s[start:end]

                for _ in range(count):
                    result.append(unpack(inner_string))

                i = end + 1
            else:
                result.append(s[i])
                i += 1

        return ''.join(result)

    def longest_prefix(strings):
        if not strings: return ""

        prefix = list(strings[0])
        for string in strings[1:]:

            min_len = minimum(length(prefix), length(string))

            for j in range(min_len):
                if prefix[j] != string[j]: break
            else: j += 1

            prefix = prefix[:j]

        return ''.join(prefix)

    n = int(input())
    packed_strings = [input() for _ in range(n)]

    unpacked_strings = [unpack(ps) for ps in packed_strings]

    common_prefix = longest_prefix(unpacked_strings)
    print(common_prefix)

if __name__ == '__main__': task22()